<!-- # -*- mode: markdown; coding: utf-8; fill-column: 60; org-indent-mode: t; column-number-mode: t; flyspell-mode: t; ispell-local-dictionary: "en"; eval: (visual-on); -*- -->

<meta charset="utf-8"/>
<meta name="viewport" content="width=device-width,initial-scale=1"/>
<link rel="stylesheet" href="style.css">


# EDAF75 - lab 1: SQL

This lab is meant to be run as a `jupyter` notebook, you could download it [here](lab1.zip) (the zip-file contains the notebook and the database, and a [.html-file](lab1.html) which you can read in case you have problems reading/running jupyter notebooks).

To start your notebook, you can use the following commands (after you've downloaded [the zip file](lab1.zip) -- observe that the `$` is the shell prompt, you shouldn't type it):

```sh
$ unzip lab1.zip
$ jupyter notebook    # or jupyter lab
```

This should start jupyter in a browser tab, and there you can click "lab1.ipynb".


# Background

We have a database to handle the academic achievements of students at LTH -- in it we have four tables:

<hr>
<table rules="all">
 <tr>
  <th align="left"><code>students:</code></th>
  <th></th>
 </tr>
 <tr>
  <td><code>ssn</code></td>
  <td>social security number</td>
 </tr>
 <tr>
  <td><code>first_name</code></td>
  <td>first name (obviously!)</td>
 </tr>
 <tr>
  <td><code>last_name</code></td>
  <td>last name</td>
 </tr>
</table>

<hr>
<table rules="all">
 <tr>
  <th align="left"><code>departments:</code></th>
  <th></th>
 </tr>
 <tr>
  <td><code>department_code</code></td>
  <td>unique code for each department</td>
 </tr>
 <tr>
  <td><code>department_name</code></td>
  <td>the name of the department, in Swedish</td>
 </tr>
</table>

<hr>
<table rules="all">
 <tr>
  <th align="left"><code>courses:</code></th>
  <th></th>
 </tr>
 <tr>
  <td><code>course_code</code></td>
  <td>course code, like <code>EDAF75</code></td>
 </tr>
 <tr>
  <td><code>course_name</code></td>
  <td>the name of the course, in Swedish (like "Databasteknik")</td>
 </tr>
 <tr>
  <td><code>department_code</code></td>
  <td>the department giving the course</td>
 </tr>
 <tr>
  <td><code>level</code></td>
  <td>the course level, like "G1", "G2", or "A"</td>
 </tr>
 <tr>
  <td><code>credits</code></td>
  <td>the number of credits for the course, like 7.5</td>
 </tr>
</table>

<hr>
<table rules="all">
 <tr>
  <th align="left"><code>taken_courses:</code></th>
  <th></th>
 </tr>
 <tr>
  <td><code>ssn</code></td>
  <td>the social security number of a student</td>
 </tr>
 <tr>
  <td><code>course_code</code></td>
  <td>the course code for the course the student has taken</td>
 </tr>
 <tr>
  <td><code>grade</code></td>
  <td>the grade for the student passing the course</td>
 </tr>
</table>

<hr>

<center>
  <img src="lab1-uml.png">
</center>

Some sample data:

```text
ssn           first_name   last_name
---           ----------   ---------
861103–2438   Bo           Ek
911212–1746   Eva          Alm
950829–1848   Anna         Nyström
...           ...          ...

department_code  department_name
---------------  ----------------------------------------
eda              Datavetenskap
edi              Informationsteori
eem              Elektrisk mätteknik
eie              Industriell elektroteknik och automation
...              ...

course_code  course_name                         department_code  level  credits
-----------  ----------------------------------  ---------------  -----  -------
ETTN05       Adaptiv signalbehandling            eit              A      7.5
FMAN10       Algebraiska strukturer              fma              A      7.5
ETIN80       Algoritmer i signalprocessorer...   eit              A      7.5
EDAF05       Algoritmer, datastrukturer och...   eda              G2     5.0
...          ...                                 ...              ...    ...

ssn           course_code   grade
---           -----------   -----
861103–2438   EDA016        4
861103–2438   EDAA01        3
911212–1746   EDA016        3
...           ...           ...
```

The tables have been created with the following SQL
statements:

```sql
CREATE TABLE students (
  ssn          CHAR(11),
  first_name   TEXT NOT NULL,
  last_name    TEXT NOT NULL,
  PRIMARY KEY  (ssn)
);

CREATE TABLE departments (
  department_code    TEXT,
  department_name    TEXT,
  PRIMARY KEY (department_code)
);

CREATE TABLE courses (
  course_code      CHAR(6),
  course_name      TEXT NOT NULL,
  department_code  TEXT,
  level            CHAR(2),
  credits          DOUBLE NOT NULL CHECK (credits >= 0),
  PRIMARY KEY      (course_code),
  FOREIGN KEY      (department_code) REFERENCES departments(department_code)
);

CREATE TABLE taken_courses (
  ssn           CHAR(11),
  course_code   CHAR(6),
  grade         INTEGER NOT NULL CHECK (grade >= 3 AND grade <= 5),
  PRIMARY KEY   (ssn, course_code),
  FOREIGN KEY   (ssn) REFERENCES students(ssn),
  FOREIGN KEY   (course_code) REFERENCES courses(course_code)
);
```

All courses offered at the "Computer Science and Engineering" program at LTH during the academic year 2013/14 are in the table 'courses`. Also, the database has been filled with made up data. SQL statements like the following have been used to insert the data:

```sql
INTO   students(ssn, first_name, last_name)
VALUES ('950705-2308', 'Anna', 'Johansson'),
       ('930702-3582', 'Anna', 'Johansson'),
       ('911212-1746', 'Eva', 'Alm'),
       ('910707-3787', 'Eva', 'Nilsson'),
       ...
```

The information about which departments gives which courses is somewhat haphazard (some of the departments in the database no longer exist, and some of them may never have existed).
Our database assumes each course is given by a single department, in real life, departments can share courses -- if you want to practice what we're talking about in week 2 and week 3, try to come up with a modification of the database design, which allows departments to share courses (you can ask your TA about it during the lab session).


# Assignments

To pass this lab, you only need to show your solutions to the problems marked REVIEW below -- that's the only ones we'll be looking at during the lab sessions.
You can skip the other problems at your own discretion, but I strongly recommend that you try them out, for practice.

As said above, this lab is designed to be run as a jupyter notebook (either using =jupyter lab=, or =jupyter notebook=).
If you haven't been able to get =jupyter= up and running on your computer, you can run the sql-commands for the problems below interactively inside =sqlite3=, or as a script file with all your commands, or inside some IDE, like [DB Browser for SQLite](https://sqlitebrowser.org/).

If you're running the lab as a notebook (and hopefully you are!), evaluate the following cells before you begin:

In [24]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [25]:
%sql sqlite:///lab1.sqlite

The tables `students`, `departments`, `courses` and `taken_courses` are already in your database, you can see some of their contents by running the cells below:

In [27]:
%%sql
SELECT  *
FROM    students
LIMIT   4

 * sqlite:///lab1.sqlite
Done.

[('950705-2308', 'Anna', 'Johansson'),
 ('930702-3582', 'Anna', 'Johansson'),
 ('911212-1746', 'Eva', 'Alm'),
 ('910707-3787', 'Eva', 'Nilsson')]

In [28]:
%%sql
SELECT  *
FROM    departments
LIMIT   4

 * sqlite:///lab1.sqlite
Done.

[('eda', 'Datavetenskap'),
 ('edi', 'Informationsteori'),
 ('eem', 'Elektrisk mätteknik'),
 ('eie', 'Industriell elektroteknik och automation')]

In [29]:
%%sql
SELECT  *
FROM    courses
LIMIT   4

 * sqlite:///lab1.sqlite
Done.

[('EDA016', 'Programmeringsteknik', 'eda', 'G1', 7.5),
 ('EDA031', 'C++ - programmering', 'eda', 'G2', 7.5),
 ('EDA040', 'Realtidsprogrammering', 'eda', 'G2', 6.0),
 ('EDA050', 'Operativsystem', 'eda', 'G2', 4.5)]

In [30]:
%%sql
SELECT  *
FROM    taken_courses
LIMIT   4

 * sqlite:///lab1.sqlite
Done.

[('950705-2308', 'EITN35', 5),
 ('950705-2308', 'ESS050', 3),
 ('950705-2308', 'ETIN70', 4),
 ('950705-2308', 'FMA140', 4)]

If you inadvertently change the contents of the tables, you can always recreate the them with the following command (it must be run at the command line):

```sh
$ sqlite3 lab1.sqlite < lab1-setup.sql
```

--------------------------------
Jump to [next REVIEW problem](#problem_5)
--------------------------------

<a id='problem_1'></a>

## Problem 1 (practice)

What are the names (first name and last name) of all the students?

In [31]:
%%sql
SELECT first_name, last_name
FROM students;

 * sqlite:///lab1.sqlite
Done.

[('Anna', 'Johansson'),
 ('Anna', 'Johansson'),
 ('Eva', 'Alm'),
 ('Eva', 'Nilsson'),
 ('Elaine', 'Robertson'),
 ('Maria', 'Nordman'),
 ('Helena', 'Troberg'),
 ('Lotta', 'Emanuelsson'),
 ('Anna', 'Nyström'),
 ('Maria', 'Andersson'),
 ('Marie', 'Persson'),
 ('Märit', 'Aspegren'),
 ('Ylva', 'Jacobsson'),
 ('Frida', 'Weidel'),
 ('Caroline', 'Olsson'),
 ('Karolin', 'Ek'),
 ('Eva', 'Hjort'),
 ('Sofia', 'Kjellberg'),
 ('Tina', 'Lööf'),
 ('Lisa', 'Berg'),
 ('Lotta', 'Bergman'),
 ('Susanne', 'Dahl'),
 ('Birgit', 'Ewesson'),
 ('Ulrika', 'Jonsson'),
 ('Jenny', 'Lundin'),
 ('Karin', 'Östberg'),
 ('Bo', 'Ek'),
 ('Bo', 'Ek'),
 ('Bo', 'Ek'),
 ('Erik', 'Andersson'),
 ('Erik', 'Andersson'),
 ('Filip', 'Gustavsson'),
 ('Niklas', 'Andersson'),
 ('David', 'Carlsson'),
 ('Tobias', 'Enberg'),
 ('Johan', 'Lind'),
 ('Magnus', 'Pettersson'),
 ('Filip', 'Persson'),
 ('Ola', 'Nilsson'),
 ('Jakob', 'Malmberg'),
 ('Henrik', 'Berg'),
 ('John', 'Lind'),
 ('Patrik', 'Lundh'),
 ('Mikael', 'Nilsson'),
 ('Joakim', 'Nilsson'),
 ('Conny', 'Modig'),
 ('Christian', 'Wallman'),
 ('Magnus', 'Strömgren'),
 ('Daniel', 'Ahlman'),
 ('Lars', 'Molin'),
 ('Magnus', 'Nilsson'),
 ('Anders', 'Olsson'),
 ('Martin', 'Alm'),
 ('Håkan', 'Mossgren'),
 ('Fredrik', 'Ryd'),
 ('Mats', 'Wikström'),
 ('Anders', 'Magnusson'),
 ('Andreas', 'Molin'),
 ('Johan', 'Brattberg'),
 ('Johan', 'Olsson'),
 ('Jonathan', 'Jönsson'),
 ('Magnus', 'Hultgren'),
 ('Axel', 'Nord'),
 ('Henrik', 'Hult'),
 ('Joakim', 'Hall'),
 ('Henrik', 'Gustavsson'),
 ('Torbjörn', 'Modig'),
 ('Daniel', 'Axelsson'),
 ('Per-Erik', 'Pettersson'),
 ('Roger', 'Brorsson'),
 ('Patrik', 'Ohlsson'),
 ('Peter', 'Solberg')]

Now sort the names, first by last name and then by first name:

In [9]:
%%sql
SELECT first_name, last_name
FROM students
ORDER BY last_name, first_name;

 * sqlite:///lab1.sqlite
Done.

[('Daniel', 'Ahlman'),
 ('Eva', 'Alm'),
 ('Martin', 'Alm'),
 ('Erik', 'Andersson'),
 ('Erik', 'Andersson'),
 ('Maria', 'Andersson'),
 ('Niklas', 'Andersson'),
 ('Märit', 'Aspegren'),
 ('Daniel', 'Axelsson'),
 ('Henrik', 'Berg'),
 ('Lisa', 'Berg'),
 ('Lotta', 'Bergman'),
 ('Johan', 'Brattberg'),
 ('Roger', 'Brorsson'),
 ('David', 'Carlsson'),
 ('Susanne', 'Dahl'),
 ('Bo', 'Ek'),
 ('Bo', 'Ek'),
 ('Bo', 'Ek'),
 ('Karolin', 'Ek'),
 ('Lotta', 'Emanuelsson'),
 ('Tobias', 'Enberg'),
 ('Birgit', 'Ewesson'),
 ('Filip', 'Gustavsson'),
 ('Henrik', 'Gustavsson'),
 ('Joakim', 'Hall'),
 ('Eva', 'Hjort'),
 ('Henrik', 'Hult'),
 ('Magnus', 'Hultgren'),
 ('Ylva', 'Jacobsson'),
 ('Anna', 'Johansson'),
 ('Anna', 'Johansson'),
 ('Ulrika', 'Jonsson'),
 ('Jonathan', 'Jönsson'),
 ('Sofia', 'Kjellberg'),
 ('Johan', 'Lind'),
 ('John', 'Lind'),
 ('Patrik', 'Lundh'),
 ('Jenny', 'Lundin'),
 ('Tina', 'Lööf'),
 ('Anders', 'Magnusson'),
 ('Jakob', 'Malmberg'),
 ('Conny', 'Modig'),
 ('Torbjörn', 'Modig'),
 ('Andreas', 'Molin'),
 ('Lars', 'Molin'),
 ('Håkan', 'Mossgren'),
 ('Eva', 'Nilsson'),
 ('Joakim', 'Nilsson'),
 ('Magnus', 'Nilsson'),
 ('Mikael', 'Nilsson'),
 ('Ola', 'Nilsson'),
 ('Axel', 'Nord'),
 ('Maria', 'Nordman'),
 ('Anna', 'Nyström'),
 ('Patrik', 'Ohlsson'),
 ('Anders', 'Olsson'),
 ('Caroline', 'Olsson'),
 ('Johan', 'Olsson'),
 ('Filip', 'Persson'),
 ('Marie', 'Persson'),
 ('Magnus', 'Pettersson'),
 ('Per-Erik', 'Pettersson'),
 ('Elaine', 'Robertson'),
 ('Fredrik', 'Ryd'),
 ('Peter', 'Solberg'),
 ('Magnus', 'Strömgren'),
 ('Helena', 'Troberg'),
 ('Christian', 'Wallman'),
 ('Frida', 'Weidel'),
 ('Mats', 'Wikström'),
 ('Karin', 'Östberg')]

When you get it to work, experiment by listing only the 10 first students (alphabetically), then try to list only students 11-20, etc.:

In [32]:
%%sql
SELECT first_name, last_name
FROM students
ORDER BY last_name, first_name
LIMIT 10;

 * sqlite:///lab1.sqlite
Done.

[('Daniel', 'Ahlman'),
 ('Eva', 'Alm'),
 ('Martin', 'Alm'),
 ('Erik', 'Andersson'),
 ('Erik', 'Andersson'),
 ('Maria', 'Andersson'),
 ('Niklas', 'Andersson'),
 ('Märit', 'Aspegren'),
 ('Daniel', 'Axelsson'),
 ('Henrik', 'Berg')]

In [10]:
%%sql
SELECT first_name, last_name
FROM students
ORDER BY last_name, first_name
LIMIT 10 OFFSET 10;

 * sqlite:///lab1.sqlite
Done.

[('Lisa', 'Berg'),
 ('Lotta', 'Bergman'),
 ('Johan', 'Brattberg'),
 ('Roger', 'Brorsson'),
 ('David', 'Carlsson'),
 ('Susanne', 'Dahl'),
 ('Bo', 'Ek'),
 ('Bo', 'Ek'),
 ('Bo', 'Ek'),
 ('Karolin', 'Ek')]

<a id='problem_2'></a>

## Problem 2 (practice)

What are the names of the students who were born in 1985?

In [33]:
%%sql
SELECT first_name, last_name
FROM students
WHERE CAST(SUBSTRING(ssn, 1, 2) AS INTEGER) >= 85;

 * sqlite:///lab1.sqlite
Done.

[('Anna', 'Johansson'),
 ('Anna', 'Johansson'),
 ('Eva', 'Alm'),
 ('Eva', 'Nilsson'),
 ('Elaine', 'Robertson'),
 ('Maria', 'Nordman'),
 ('Helena', 'Troberg'),
 ('Lotta', 'Emanuelsson'),
 ('Anna', 'Nyström'),
 ('Maria', 'Andersson'),
 ('Marie', 'Persson'),
 ('Märit', 'Aspegren'),
 ('Ylva', 'Jacobsson'),
 ('Frida', 'Weidel'),
 ('Caroline', 'Olsson'),
 ('Karolin', 'Ek'),
 ('Eva', 'Hjort'),
 ('Sofia', 'Kjellberg'),
 ('Tina', 'Lööf'),
 ('Lisa', 'Berg'),
 ('Lotta', 'Bergman'),
 ('Susanne', 'Dahl'),
 ('Birgit', 'Ewesson'),
 ('Ulrika', 'Jonsson'),
 ('Jenny', 'Lundin'),
 ('Karin', 'Östberg'),
 ('Bo', 'Ek'),
 ('Bo', 'Ek'),
 ('Bo', 'Ek'),
 ('Erik', 'Andersson'),
 ('Erik', 'Andersson'),
 ('Filip', 'Gustavsson'),
 ('Niklas', 'Andersson'),
 ('David', 'Carlsson'),
 ('Tobias', 'Enberg'),
 ('Johan', 'Lind'),
 ('Magnus', 'Pettersson'),
 ('Filip', 'Persson'),
 ('Ola', 'Nilsson'),
 ('Jakob', 'Malmberg'),
 ('Henrik', 'Berg'),
 ('John', 'Lind'),
 ('Patrik', 'Lundh'),
 ('Mikael', 'Nilsson'),
 ('Joakim', 'Nilsson'),
 ('Conny', 'Modig'),
 ('Christian', 'Wallman'),
 ('Magnus', 'Strömgren'),
 ('Daniel', 'Ahlman'),
 ('Lars', 'Molin'),
 ('Magnus', 'Nilsson'),
 ('Anders', 'Olsson'),
 ('Martin', 'Alm'),
 ('Håkan', 'Mossgren'),
 ('Fredrik', 'Ryd'),
 ('Mats', 'Wikström'),
 ('Anders', 'Magnusson'),
 ('Andreas', 'Molin'),
 ('Johan', 'Brattberg'),
 ('Johan', 'Olsson'),
 ('Jonathan', 'Jönsson'),
 ('Magnus', 'Hultgren'),
 ('Axel', 'Nord'),
 ('Henrik', 'Hult'),
 ('Joakim', 'Hall'),
 ('Henrik', 'Gustavsson'),
 ('Torbjörn', 'Modig'),
 ('Daniel', 'Axelsson'),
 ('Per-Erik', 'Pettersson'),
 ('Roger', 'Brorsson'),
 ('Patrik', 'Ohlsson'),
 ('Peter', 'Solberg')]

Hint: the `substr` function can be useful (it also goes by the name `substring`).


<a id='problem_3'></a>

## Problem 3 (practice)

The penultimate digit in the social security number is even for females, and odd for males.
List the first names of all female students in our database alphabetically.

In [12]:
%%sql
SELECT first_name
FROM students
WHERE MOD(SUBSTRING(ssn, LENGTH(ssn) - 1, 1), 2) = 0
ORDER BY first_name;

 * sqlite:///lab1.sqlite
Done.

[('Anna',),
 ('Anna',),
 ('Anna',),
 ('Birgit',),
 ('Caroline',),
 ('Elaine',),
 ('Eva',),
 ('Eva',),
 ('Eva',),
 ('Frida',),
 ('Helena',),
 ('Jenny',),
 ('Karin',),
 ('Karolin',),
 ('Lisa',),
 ('Lotta',),
 ('Lotta',),
 ('Maria',),
 ('Maria',),
 ('Marie',),
 ('Märit',),
 ('Sofia',),
 ('Susanne',),
 ('Tina',),
 ('Ulrika',),
 ('Ylva',)]

Now try to output each name only once (so, no duplicates).

In [13]:
%%sql
SELECT DISTINCT first_name
FROM students
WHERE MOD(SUBSTRING(ssn, LENGTH(ssn) - 1, 1), 2) = 0
ORDER BY first_name;

 * sqlite:///lab1.sqlite
Done.

[('Anna',),
 ('Birgit',),
 ('Caroline',),
 ('Elaine',),
 ('Eva',),
 ('Frida',),
 ('Helena',),
 ('Jenny',),
 ('Karin',),
 ('Karolin',),
 ('Lisa',),
 ('Lotta',),
 ('Maria',),
 ('Marie',),
 ('Märit',),
 ('Sofia',),
 ('Susanne',),
 ('Tina',),
 ('Ulrika',),
 ('Ylva',)]

<a id='problem_4'></a>

## Problem 4 (practice)

How many students are registered in the database?

In [34]:
%%sql
SELECT COUNT(*) AS f_students
FROM students;

 * sqlite:///lab1.sqlite
Done.

[(72,)]

How many male students are there?

In [15]:
%%sql
SELECT COUNT(*) AS m_students
FROM students
WHERE MOD(SUBSTRING(ssn, LENGTH(ssn)-1, 1), 2)= 1;

 * sqlite:///lab1.sqlite
Done.

[(46,)]

Now try to output the number of distinct names in the listing of female students above, using `count`.
It turns out that this is a bit tricky, we need to make sure we use the word `DISTINCT` in the right place (look carefully in the [documentation](https://sqlite.org/lang_aggfunc.html)).

In [35]:
%%sql
SELECT COUNT(DISTINCT CONCAT(student.first_name, ' ', student.last_name)
FROM students
WHERE MOD(SUBSTRING(ssn, LENGTH(ssn)-1, 1), 2)= 2;

 * sqlite:///lab1.sqlite
(sqlite3.OperationalError) near "FROM": syntax error
[SQL: SELECT COUNT(DISTINCT CONCAT(student.first_name, ' ', student.last_name)
FROM students
WHERE MOD(SUBSTRING(ssn, LENGTH(ssn)-1, 1), 2)= 2;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

<a id='problem_5'></a>

## Problem 5 -- REVIEW

How many courses are there for each level (`G1`, `G2`, and `A`)?

In [36]:
%%sql
SELECT level, COUNT(*)
FROM courses
GROUP BY level;

 * sqlite:///lab1.sqlite
Done.

[('A', 87), ('G1', 31), ('G2', 60)]

For each level, how many courses give more than 7.5 HP?

In [45]:
%%sql
SELECT level, COUNT(*)
FROM courses
WHERE credits > 7.5
GROUP BY level;

 * sqlite:///lab1.sqlite
Done.

[('A', 3), ('G1', 6), ('G2', 7)]

Jump to [next REVIEW problem](#problem_7)

<a id='problem_6'></a>

## Problem 6 (practice)

In the next few queries, we'll look at the results of the student with the social security number 910101-1234 -- to make things _a lot_ easier, start by creating a `VIEW` with all his results.

In [47]:
%%sql
DROP VIEW IF EXISTS student;

CREATE VIEW student AS
SELECT course_code, course_name, grade, credits
FROM taken_courses
WHERE taken_courses.ssn = '910101-1234'
JOIN courses ON (taken_courses.course_code = courses.course_code);

 * sqlite:///lab1.sqlite
Done.
(sqlite3.OperationalError) near "JOIN": syntax error
[SQL: CREATE VIEW student AS
SELECT course_code, course_name, grade, credits
FROM taken_courses
WHERE taken_courses.ssn = '910101-1234'
JOIN courses ON (taken_courses.course_code = courses.course_code);]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

Make sure the view contains all data pertinent to the student in question (it will make the following queries very simple).

Which courses (course codes only) have been taken by the student?

In [39]:
%%sql
SELECT course_code
FROM student;

 * sqlite:///lab1.sqlite
(sqlite3.OperationalError) no such table: student
[SQL: SELECT course_code
FROM student;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

What are the names of these courses, and how many credits do they give?

In [40]:
%%sql
SELECT course_name, credits
FROM student;

 * sqlite:///lab1.sqlite
(sqlite3.OperationalError) no such table: student
[SQL: SELECT course_name, credits
FROM student;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

How many credits has the student taken?

In [41]:
%%sql
SELECT SUM(credits) AS t_credits
FROM student;

 * sqlite:///lab1.sqlite
(sqlite3.OperationalError) no such table: student
[SQL: SELECT SUM(credits) AS t_credits
FROM student;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

What is the student’s grade average?
It turns out that there are actually (at least) two different averages at play here:

+ the unweighted average, i.e., just the average of all the students grades (no matter how many credits each course gives), and

+ the [weighted average](https://en.wikipedia.org/wiki/Weighted_arithmetic_mean), where we use the credits for a course as a weight.

First the unweighted average:

In [23]:
%%sql
SELECT AVG(grade) AS unweighted_average
FROM student;

 * sqlite:///lab1.sqlite
(sqlite3.OperationalError) no such table: student
[SQL: SELECT AVG(grade) AS unweighted_average
FROM student;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

And then the weighted average (feel free to ask me about this during QA sessions, if you get stuck):

In [12]:
%%sql
SELECT (SUM(credits * grade) / SUM(credits)) AS weighter_grade
FROM student;

Environment variable $DATABASE_URL not set, and no connect string given.
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

Hint: If you've created a proper view above, we'll get a 'table' with one row for each course the student has passed, and each row will contain information about grades and credits for the passed course.
If we use arithmetic operations in a select statement, and then use an aggregate function around that operation, we'll apply the aggregate function to each value the operation returns (so, e.g., a `sum` over a product will be a scalar product).

Now drop the view:

In [13]:
%%sql
DROP VIEW IF EXISTS studet;

Environment variable $DATABASE_URL not set, and no connect string given.
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

<a id='problem_7'></a>

## Problem 7 - REVIEW

For the five departments which offers the most total credits (for its courses in this database) -- output the name of the department, and the total number of offered credits:

In [50]:
%%sql
SELECT departments.department_name, SUM(courses.credits) AS t_credits
FROM departments
JOIN courses ON (departments.department_code = courses.department_code)
GROUP BY departments.department_name
ORDER BY t_credits DESC
LIMIT 5;

 * sqlite:///lab1.sqlite
Done.

[('Elektro- och informationsteknik', 332.0),
 ('Datavetenskap', 216.0),
 ('Matematik', 160.0),
 ('Språk och litteraturcentrum', 106.5),
 ('Matematisk statistik', 84.0)]

Jump to [next REVIEW problem](#problem_8)

<a id='problem_8'></a>

## Problem 8 - REVIEW

Which students (`ssn` and full name) have taken 0 credits? This problem can be solved in several ways, first do it with an outer join:

In [77]:
%%sql
SELECT students.ssn, (students.first_name|| ' ' ||students.last_name) AS fullname
FROM students
LEFT JOIN taken_courses ON (students.ssn = taken_courses.ssn)
WHERE taken_courses.ssn IS NULL;

 * sqlite:///lab1.sqlite
Done.

[('950829-1848', 'Anna Nyström'),
 ('870909-3367', 'Caroline Olsson'),
 ('931225-3158', 'Bo Ek'),
 ('891220-1393', 'Erik Andersson'),
 ('900313-2257', 'Erik Andersson'),
 ('891007-3091', 'Johan Lind'),
 ('850517-2597', 'Filip Persson'),
 ('911015-3758', 'Jonathan Jönsson'),
 ('950125-1153', 'Magnus Hultgren'),
 ('880206-1915', 'Joakim Hall'),
 ('900129-3374', 'Henrik Gustavsson')]

Now do the same thing using a subquery:

In [78]:
%%sql
SELECT students.ssn, (students.first_name|| ' ' ||students.last_name) AS fullname
FROM students
WHERE students.ssn NOT IN (
  SELECT taken_courses.ssn
  FROM taken_courses);

 * sqlite:///lab1.sqlite
Done.

[('950829-1848', 'Anna Nyström'),
 ('870909-3367', 'Caroline Olsson'),
 ('931225-3158', 'Bo Ek'),
 ('891220-1393', 'Erik Andersson'),
 ('900313-2257', 'Erik Andersson'),
 ('891007-3091', 'Johan Lind'),
 ('850517-2597', 'Filip Persson'),
 ('911015-3758', 'Jonathan Jönsson'),
 ('950125-1153', 'Magnus Hultgren'),
 ('880206-1915', 'Joakim Hall'),
 ('900129-3374', 'Henrik Gustavsson')]

Jump to [next REVIEW problem](#problem_9)

<a id='problem_9'></a>

## Problem 9 - REVIEW

List the names and average grades of the 10 students with the highest grade average? You can use the unweighted average.

In [84]:
%%sql
SELECT (students.first_name|| ' '|| students.last_name) AS full_name, AVG(taken_courses.grade) AS avg_grade
FROM students
LEFT JOIN taken_courses ON (students.ssn = taken_courses.ssn)
GROUP BY(students.ssn)
ORDER BY avg_grade DESC
LIMIT 10;

 * sqlite:///lab1.sqlite
Done.

[('Bo Ek', 4.35),
 ('Helena Troberg', 4.3076923076923075),
 ('Elaine Robertson', 4.235294117647059),
 ('Anna Johansson', 4.230769230769231),
 ('Ylva Jacobsson', 4.21875),
 ('Anna Johansson', 4.2),
 ('Mikael Nilsson', 4.173913043478261),
 ('Jakob Malmberg', 4.166666666666667),
 ('Maria Andersson', 4.157894736842105),
 ('Per-Erik Pettersson', 4.153846153846154)]

Jump to [next REVIEW problem](#problem_10)

<a id='problem_10'></a>

## Problem 10 - REVIEW

List the social security number and total number of credits for all students -- order by total credits, descending. Students with no credits should be included in the listing, with 0 credits (not `NULL`).

Use an outer `JOIN` to solve the problem -- you might want to use the function `coalesce(v1, v2, ...)`; it returns the first value which is not `NULL`, so `coalesce(avg(grade), 0)` would give 0 if the were no grades (i.e., if `grade` were `NULL`), you can also try the `ifnull` function.

In [85]:
%%sql
SELECT students.ssn, COALESCE(SUM(taken_courses.credit), 0) AS t_credits
FROM students
LEFT JOIN taken_courses ON students.ssn = taken_courses.ssn
GROUP BY students.ssn
ORDER BY t_credits DESC;

 * sqlite:///lab1.sqlite
(sqlite3.OperationalError) no such column: taken_courses.credit
[SQL: SELECT students.ssn, COALESCE(SUM(taken_courses.credit), 0) AS t_credits
FROM students
LEFT JOIN taken_courses ON students.ssn = taken_courses.ssn
GROUP BY students.ssn
ORDER BY t_credits DESC;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

Jump to [next REVIEW problem](#problem_11)

<a id='problem_11'></a>

## Problem 11 - REVIEW

Do all students have unique names (first name _and_ last name)? If not, show the full name and social security number for all students who have a namesake.

As usual there are several ways of solving this, solve it using a `WITH`-statement where you create a 'table' with all duplicate names, and then:

Use a `JOIN`:

In [73]:
%%sql
WITH dup_names AS (
  SELECT first_name, last_name, COUNT(*) AS num_namesake
  FROM students
  GROUP BY first_name, last_name
  HAVING num_namesake > 1
)

SELECT students.first_name, students.last_name, students.ssn
FROM students
JOIN dup_names ON (students.first_name = dup_names.first_name and students.last_name = dup_names.last_name);

 * sqlite:///lab1.sqlite
Done.

[('Anna', 'Johansson', '950705-2308'),
 ('Anna', 'Johansson', '930702-3582'),
 ('Bo', 'Ek', '861103-2438'),
 ('Bo', 'Ek', '931225-3158'),
 ('Bo', 'Ek', '850819-2139'),
 ('Erik', 'Andersson', '891220-1393'),
 ('Erik', 'Andersson', '900313-2257')]

Use a subquery:

In [69]:
%%sql
WITH dup_names as (
  SELECT (first_name|| ' '|| last_name) as full_name, COUNT(*) as num_namesake
  FROM students
  GROUP BY first_name, last_name
  HAVING num_namesake > 1
)

SELECT (students.first_name || ' ' || students.last_name) AS full_name, students.ssn
FROM students
WHERE first_name|| ' '|| last_name IN (
SELECT dup_names.full_name
FROM dup_names);

 * sqlite:///lab1.sqlite
Done.

[('Anna Johansson', '950705-2308'),
 ('Anna Johansson', '930702-3582'),
 ('Bo Ek', '861103-2438'),
 ('Bo Ek', '931225-3158'),
 ('Bo Ek', '850819-2139'),
 ('Erik Andersson', '891220-1393'),
 ('Erik Andersson', '900313-2257')]